Tekla.Structures.Model.Seam
The Seam class represents a seam. A seam is something that connects a main part to other parts along an edge.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using Tekla.Structures;
using System;
public class Example
{
public void Example1()
{
Beam B1 = new Beam(new Point(15000,3000,0), new Point(21000,3000,0));
B1.Profile.ProfileString = "780*380";
B1.Material.MaterialString = "K40-1";
B1.Class = "5";
B1.Position.Plane = Position.PlaneEnum.MIDDLE;
B1.Position.Rotation = Position.RotationEnum.TOP;
B1.Position.Depth = Position.DepthEnum.BEHIND;
Beam B2 = new Beam(new Point(15000,3000,0), new Point(21000,3000,0));
B2.Profile.ProfileString = "780*380";
B2.Material.MaterialString = "K40-1";
B2.Class = "6";
B2.Position.Plane = Position.PlaneEnum.MIDDLE;
B2.Position.Rotation = Position.RotationEnum.TOP;
B2.Position.Depth = Position.DepthEnum.FRONT;
B1.Insert();
B2.Insert();
Seam S = new Seam();
S.Name = "seamdm";
S.Number = -1;
S.LoadAttributesFromFile("standard");
S.UpVector = new Vector(0,0,0);
S.AutoDirectionType = AutoDirectionTypeEnum.AUTODIR_BASIC;
S.AutoPosition = true;
S.SetPrimaryObject(B1);
S.SetSecondaryObject(B2);
S.SetInputPositions(new Point(15000,3000,0), new Point(21000,3000,0));
if(!S.Insert())
Console.WriteLine("Seam Insert failed");
else
Console.WriteLine(S.Identifier.ID);
}
}

Tekla.Structures.Model.Seam.UpVector
A vector indicating which direction is considered the up direction for the seam.

Tekla.Structures.Model.Seam.AutoDirectionType
The auto direction type. Default value is AUTODIR_BASIC.
Value should be AUTODIR_NA to set direction with UpVector property.
Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with seam attribute file.

Tekla.Structures.Model.Seam.AutoPosition
The auto position type. Defines that the seam will internally evaluate the final position more accurately. The input
positions are still needed for reference.

Tekla.Structures.Model.Seam.Code
The code of the seam. The code can be used to classify the seam.
The code can be reported and shown in drawings.
The maximum length of the string is 20 characters.

Tekla.Structures.Model.Seam.Class
The class of the seam.

Tekla.Structures.Model.Seam.Status
The read only status of the seam.
The status can be reported and shown in drawings.
The color of the connection symbol in the model indicates the status of the seam.

Tekla.Structures.Model.Seam.#ctor
Creates a new seam instance.

Tekla.Structures.Model.Seam.SetPrimaryObject(Tekla.Structures.Model.ModelObject)
Sets the primary object.
M: The primary object.
Returns: True on success.

Tekla.Structures.Model.Seam.GetPrimaryObject
Returns the primary object.
Returns: The primary object.

Tekla.Structures.Model.Seam.SetSecondaryObject(Tekla.Structures.Model.ModelObject)
Sets the secondary object of the seam. Use this
method if you wish to add only one secondary object
to the seam.
M: The secondary object.
Returns: True on success.

Tekla.Structures.Model.Seam.SetSecondaryObjects(System.Collections.ArrayList)
Sets the secondary objects.
Secondaries: An array list containing all the secondary objects.
Returns: True on success.

Tekla.Structures.Model.Seam.GetSecondaryObjects
Returns an array list containing all the secondary objects.
Returns: An array list containing the secondary objects.

Tekla.Structures.Model.Seam.SetInputPositions(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Sets the start and end point of the seam.
StartPoint: The start point of the seam.
EndPoint: The end point of the seam.
Returns: True on success.

Tekla.Structures.Model.Seam.GetStartAndEndPositions(Tekla.Structures.Geometry3d.Point@,Tekla.Structures.Geometry3d.Point@)
Returns the start and end points of the seam.
StartPoint: The start point of the seam.
EndPoint: The end point of the seam.
Returns: True on success.

Tekla.Structures.Model.Seam.SetInputPolygon(Tekla.Structures.Model.Polygon)
Sets the input polygon of the seam.
InputPolygon: The input polygon of the seam.
Returns: True on success.

Tekla.Structures.Model.Seam.GetInputPolygon
Returns the input polygon of the seam.
Returns: The input polygon of the seam instance.

Tekla.Structures.Model.Seam.Insert
Inserts the seam into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.Seam.Select
Selects a seam from the model database. The seam ID must be set.
Returns: True on success.

Tekla.Structures.Model.Seam.Modify
Modifies the existing seam in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.Seam.Delete
Deletes the seam instance with the given ID from the model database.
Returns: True on success.